{
    "B_001" : "Connect Wallet",
    "B_002" : "Disconnect Wallet",
    "B_003" : "Move to my(same) address",
    "L_001_1" : "Move DFM tokens on ",
    "L_001_2" : " network to ",
    "L_001_3" : " network.",
    "L_002" : "Amount to move",
    "L_003_1" : "Do you agree with ",
    "L_003_2" : "Terms and Conditions",
    "L_003_3" : "?",
    "L_004" : " address",
    "L_005" : "You can only swap when base GAS Fee is lower than 80 Gwei.",
    "A_001" : "Transaction is on pending...",
    "A_002" : "Swap succeeded.",
    "A_003" : "Transaction Failed!",
    "A_004_1" : "Check your wallet is connected to ",
    "A_004_2" : ".",
    "A_005" : "Cannot make a swap request to Smart-contract now.",
    "T_001" : "DFM Bridge Terms and Conditions",
    "T_001_1" : "Chapter 1 General Rules",
    "T_001_1_1" : "Article 1 Purpose",
    "T_001_1_1_1" : "These terms and conditions are aimed at mutual development by determining and implementing the obligations and rights of those who use the service  provided through the DFM bridge (hereinafter referred to as 'service') developed by DFM eco Inc. (hereinafter referred to as 'company').",
    "T_001_1_2" : "Article 2 Specification, effect, and revision of the terms and conditions",
    "T_001_1_2_1" : "1. It takes effect when the company posts the contents of these terms and conditions on the company's website or notifies the user by other methods.",
    "T_001_1_2_2" : "2. The company may amend these terms and conditions to the extent that they do not violate related laws such as 'Act on Promotion of Information and Communication Network Utilization and Information Protection, etc.'",
    "T_001_1_2_3" : "3. When the company revises the terms and conditions, it shall notify the initial screen, pop-up screen, or notice board of the corporate website along with the current terms and conditions 7 days before the application date.",
    "T_001_1_2_4" : "4. If the user does not express their intention within 14 days after the company notifies the amended terms and conditions in accordance with the preceding paragraph, the user shall be deemed to have agreed to the amended terms and conditions.",
    "T_001_1_2_5" : "When the user disagrees with the application of the revised terms and conditions, the company cannot apply the contents of the revised terms and conditions. However, if there are special circumstances in which the existing terms and conditions cannot be applied, the company may terminate the use contract",
    "T_001_1_2_6" : "- We provide services to users on the condition that users agree to the terms and conditions, and when users agree, these apply first to the service provision and service use. Agreeing to these terms and conditions means agreeing to regularly visit the corporate website to confirm changes of the terms and conditions. We are not responsible for any damage to users for not knowing the information on the changed terms and conditions.",
    "T_001_1_2_7" : "Matters not specified in these terms and conditions shall be governed by the Framework Act on Telecommunications, the Telecommunications Business Act, the Korea Communications Standards Commission's deliberation regulations on information and communication, the Copyright Act, and other relevant laws.",
    "T_001_1_3" : "Article 3 Definition of Terms",
    "T_001_1_3_1" : "1. The definition of terms used in these terms and conditions is as follows.",
    "T_001_1_3_1_1" : "(1) DFM Bridge: It is called DFM Bridge throughout the Bridge Interface, the Lockup Contract, and the Bridge Middleware that exchange DFM tokens in different networks.",
    "T_001_1_3_1_2" : "(2) Bridge Interface: It refers to a page for receiving information for transferring DFM tokens to another network.",
    "T_001_1_3_1_3" : "(3) Lockup Contract: It refers to a contract account in which a user stores and withdraws DFM tokens to be converted.",
    "T_001_1_3_1_4" : "(4) Bridge Middleware (Demon): It refers to a program that monitors the Lockup Contract and performs designated tasks when an exchange application is made.",
    "T_001_1_3_1_5" : "(5) WalletConnect: It refers to a socket communication protocol that allows an interface and a wallet to exchange data.",
    "T_001_1_3_1_6" : "(6) DFM token: It refers to a token issued by the company. It is an important means of realizing DFM eco, and refers to a means of storing the value from the platform linked to DFM eco.",
    "T_001_1_3_1_7" : "(7) Transaction: It refers to a record containing information of performing functions related to bridge smart contracts and swaps.",
    "T_001_1_3_1_8" : "(8) Swap: It refers to exchanging DFM tokens in different networks.",
    "T_001_1_3_1_9" : "(9) DFM Bridge Service Fee: It is a cost other than the transaction required to use the DFM Bridge in the network, and refers to the amount deducted as DFM token by the company.",
    "T_001_1_3_1_10" : "(10) Gas: It refers to a unit that refers to a fee that makes a transaction.",
    "T_001_1_3_1_11" : "(11) Gas Price : It refers to the price per unit of Gas to make transactions.",
    "T_001_1_3_1_12" : "(12) Gas Limit : It refers to the number of gases to make transactions.",
    "T_001_1_3_1_13" : "(13) Gas Fee : It refers to the total price of GAS (=Gas Price * Gas Limit).",
    "T_001_2" : "Chapter 2 General Rules for Service Use",
    "T_001_2_1" : "Article 4 Notice and Change of Service Contents",
    "T_001_2_1_1" : "1. Depending on the type of service, the company shall notify the features, procedures, and methods of each service through the service screen or the corporate website, and users shall understand the matters related to each service announced by the company before they use the service.",
    "T_001_2_1_2" : "2. If the contents of the service are changed, the company shall notify at least 7 days before the change, and shall not be liable for any damages from the user's failure to inquire about the contents of the notice.",
    "T_001_2_2" : "Article 5 Service Process ",
    "T_001_2_2_1" : "1. The service processes the requested swap in order.",
    "T_001_2_2_1_1" : "(1) Users can request a new swap only when the Bridge Middleware completes the swap processing.",
    "T_001_2_2_1_2" : "(2) If the Bridge Middleware fails to complete the swap process for some reasons, the user cannot request a new swap.",
    "T_001_2_3" : "Article 6 Maintenance and Interruption of Services",
    "T_001_2_3_1" : "1. In principle, the use of services shall be 24 hours a day, unless there is a special impediment to the company's operations, except in cases where regular service inspections or emergency inspections are required.",
    "T_001_2_3_2" : "2. The company can set the available time for each service and must notify it in advance.",
    "T_001_2_3_3" : "3. The company may temporarily suspend the provision of services in any of the following cases.",
    "T_001_2_3_3_1" : "(1) In the event where it is inevitable to stop for the repair or replacement of service facilities,",
    "T_001_2_3_3_2" : "(2) In the event where a key telecommunication business operator stipulated in the Telecommunications Business Act suspends electricity or communication services",
    "T_001_2_3_3_3" : "(3) Maintenance, upgrade, failure, communication interruption of equipment and blockchain systems.",
    "T_001_2_3_3_4" : "(4) In the events such as typhoons, earthquakes, tsunamis, floods, power outages, national emergencies, war or terrorist attacks, computer viruses, Trojan horses, hacker attacks, and system instability, etc.",
    "T_001_2_3_3_5" : "(5) In the event of a situation that the company cannot control or predict",
    "T_001_2_3_3_6" : "(6) In the event where the service usage or the transaction is impossible due to a failure of service facilities or an overload of service use.",
    "T_001_2_3_4" : "4. Due to the high Gas Price, the service may be stopped by preset when expenditures above the baseline gas fees are expected due to transactions done by DFM middleware.",
    "T_001_2_4" : "Article 7 Responsibility for illegal use of services",
    "T_001_2_4_1" : "1. The responsibility from the illegal use of the service shall be entirely the responsibility of the user. The illegal use falls under any of the following cases.",
    "T_001_2_4_1_1" : "(1) In the event where the user provides personal information to a third party in a state of controlling it, delegates its use, or provides it for the purpose of transfer or security",
    "T_001_2_4_1_2" : "(2) In the event where illegal use occurs due to intention or negligence of the user.",
    "T_001_2_5" : "Article 8 Intellectual Property",
    "T_001_2_5_1" : "1. All intellectual property rights related to the company's services, such as software, patents, and trademark rights, belong to the company.",
    "T_001_2_5_2" : "2. The user shall not process and sell information related to the above intellectual property rights obtained by using this service and use or transfer data related to the intellectual property rights of the above company published in these terms and conditions to a third party.",
    "T_001_2_6" : "Article 9 Dispute Settlement and Objection",
    "T_001_2_6_1" : "1. When the user wants to make an objection regarding the use of the service, the user may object to the company via e-mail within 30 days from the date of service use.",
    "T_001_2_6_2" : "2. If there is an objection from the user, the company shall investigate the date of service use, details of use, and subject of use, and inform the user of the result by e-mail.",
    "T_001_2_6_3" : "3. If there is an objection to the results of the company's investigation, the user may apply for a re-investigation only once within 7 days from the notification of the results of the investigation.",
    "T_001_2_7" : "Article 10 Court of jurisdiction and applicable law",
    "T_001_2_7_1" : "1. In the event of a dispute over the use of services, such as the imposition of a company's fee, it shall be judged by the competent court of the company's headquarters.",
    "T_001_2_7_2" : "2. In the event of a dispute between the company and the user regarding the use of services provided by the company, Korean law shall apply.",
    "T_001_2_7_3" : "3. These terms and conditions use both Korean and English terms and conditions. However, if the legal interpretation is different, the Korean terms and conditions are the standards for judgment.",
    "T_001_2_7_4" : "4. The laws of the Republic of Korea are the standard for matters not included in these terms and conditions and general correlations with the provisions of consumer protection guidelines and related laws in e-commerce, etc. enacted by the Fair Trade Commission.",
    "T_001_2_8" : "Article 11 Responsibility of the user",
    "T_001_2_8_1" : "1. Users are obligated to give accurate information required by the corporate website.",
    "T_001_2_8_2" : "2. When the government requests users to submit transaction details, users are obligated to report.",
    "T_001_2_8_3" : "3. Transactions within the blockchain cannot be reversed. Users must check their details when trading through cryptocurrency.",
    "T_001_3" : "Chapter 3 DFM Bridge Service Fee and GAS Fee",
    "T_001_3_1" : "Article 11 Service Fees and Related Expenses",
    "T_001_3_1_1" : "1. DFM bridge service fees can be changed according to the company's decision.<",
    "T_001_3_1_2" : "2. The DFM bridge service fee refers to the company's payment in return for using the DFM bridge, and refers to the amount charged to the user with the DFM token.",
    "T_001_3_1_3" : "3. Gas Fee refers to the network fee for using the network, and the Gas Fee is always different depending on the network load.",
    "T_001_3_1_4" : "4. The reason for claiming DFM bridge fees is to replace the costs incurred when Bridge Middleware automatically processes transactions.",
    "T_001_4" : "Chapter 4 Compensation for Damages and Indemnity provisions",
    "T_001_4_1" : "Article 12 Compensation for damages",
    "T_001_4_1_1" : "1. The company shall not be liable for damages for accidents from transactions for not obeying the  rules stipulated in these terms and conditions.",
    "T_001_4_1_2" : "2. The company does not intervene in any private disputes between users from the user's negligence and is not liable for damages arising from them.",
    "T_001_4_1_3" : "3. When a user causes damage to the company in connection with Article 8, he/she shall compensate for the damages resulting therefrom.",
    "T_001_4_2" : "Article 13 Company's disclaimer",
    "T_001_4_2_1" : "In each of the following cases, the company is exempted from any civil or criminal liability",
    "T_001_4_2_1_1" : "1. In the event where a loss occurs due to intention or negligence of the user",
    "T_001_4_2_1_2" : "2. In the event where a loss occurs to a user due to a failure in telecommunication services provided by a telecommunication service provider",
    "T_001_4_2_1_3" : "3. In the event of a failure or error while implementing the service due to server instability",
    "T_001_4_2_1_4" : "4. In the event of a failure or error in the blockchain network",
    "T_001_4_2_1_5" : "5. DFM token exchange is delayed or failed due to an increase of Gas Prices of networks",
    "T_001_4_2_1_6" : "6. In the event where DFM token swap is stopped due to high Gas Price",
    "T_001_4_2_1_7" : "7. In the event where an accident occurs due to the user's failure to comply with the user's management obligations",
    "T_001_4_2_1_8" : "8. In the event where a problem occurs due to the use of a service for a purpose other than a permitted use by the user",
    "T_001_4_2_1_9" : "9. In the case where a wrong transaction occurs due to the user's negligence (e.g., forgery of the user's terminal, computer virus, Trojan horse, hacker attack, system instability, etc.).",
    "T_001_4_3" : "Article 14 Handling user's complaints and disputes",
    "T_001_4_3_1" : "1. For user's convenience, the user's opinions or complaints are presented through the social media links posted on the company's website, and the company shall promptly handle them.",
    "T_002" : "Close"
}